{
  "backend/main.mo": "Motoko canister implementing chat threads, messages, user profiles, access entitlements, and authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test coverage.",
  "frontend-file-summaries.txt": "No summary available.",
  "frontend/index.css": "Tailwind base styles defining color tokens, theme variables, and dark‑mode overrides.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Top‑level React app handling auth flow, profile setup, access checks, and routing to chat UI.",
  "frontend/src/components/access/PendingAccessScreen.tsx": "UI screen for users without chat access, allowing request or refresh of entitlement status.",
  "frontend/src/components/admin/AccessManagementDialog.tsx": "Admin dialog for granting, revoking, and approving access requests, with optional chat initiation and user/entitlement management.",
  "frontend/src/components/auth/AuthenticatedLoadingShell.tsx": "Full‑screen loading view showing the PriveChat logo while authenticated session data loads.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that handles login/logout via Internet Identity and manages UI states during authentication.",
  "frontend/src/components/chat/ChatLayout.tsx": "Main chat layout managing thread list, active thread view, new chat flow, admin access dialog, and settings dialog.",
  "frontend/src/components/chat/ChatThreadView.tsx": "Displays a chat thread with messages, participant info, blocking and deletion options, and auto‑scroll behavior.",
  "frontend/src/components/chat/MessageComposer.tsx": "Input bar for composing and sending messages with validation, error display, and loading feedback.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a single message with sender info, edit/delete controls, and deleted‑message handling.",
  "frontend/src/components/chat/ThreadList.tsx": "Lists user threads, showing basic metadata and enabling thread selection with loading and empty states.",
  "frontend/src/components/chat/UserSearchStartChat.tsx": "Provides a UI for searching users and creating new chat threads, handling loading, errors, and thread creation states.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting the user to submit a display name and register their profile with a simple form.",
  "frontend/src/components/profile/UserBadge.tsx": "Displays the current user's avatar, display name, and a shortened version of their principal.",
  "frontend/src/components/settings/SettingsDialog.tsx": "Settings dialog showing the user's principal, user lists based on admin status, and clipboard copy actions.",
  "frontend/src/hooks/useAccessControl.ts": "React Query hooks for checking admin status and managing access entitlements including grant, revoke, and approve actions.",
  "frontend/src/hooks/useAccessEntitlement.ts": "Hooks for checking and requesting user access entitlements, refreshing related queries, and deriving access state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useBlocking.ts": "Hooks for checking, listing, blocking, and unblocking users with reactive query invalidation.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch, save, and register the current user's profile, and to retrieve the current principal.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for authentication, exposing identity state and login/logout methods.",
  "frontend/src/hooks/useMessages.ts": "Defines mutations to send, edit, and delete messages, invalidating message queries on success and enforcing access checks.",
  "frontend/src/hooks/useThreads.ts": "Contains hooks to fetch threads and messages, and to create or delete threads with appropriate query invalidation and access checks.",
  "frontend/src/hooks/useUsers.ts": "Provides hooks to fetch chat users, search users, fetch all entitlement-based users, and load specific user profiles.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables and layout rules.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/utils/clipboard.ts": "Utility for safely copying text to the clipboard with error handling.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session-stored parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme settings, custom colors, animations, and includes typography, container-queries, and animate plugins.",
  "project_state.json": "Defines overall project state for the PriveChat app, including requirements, architectural notes, known issues, and feature metadata for debugging and planning."
}