{
  "backend/main.mo": "Motoko canister defining chat threads, messages, user profiles, access entitlements, and authorization checks with stateful maps and helper guards.",
  "feature_evidence.json": "JSON report listing feature changes, involved files, components, tests, and confidence levels for recent frontend optimizations.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend React files including hooks, components, and styles.",
  "frontend/index.css": "Tailwind base and theme variable definitions implementing app-wide color tokens, dark mode, and global styles.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app logic handling authentication, profile setup, access checks, and conditional rendering of chat or access screens.",
  "frontend/src/components/access/PendingAccessScreen.tsx": "UI screen for users without chat access that handles requesting or refreshing entitlement status and shows state‑specific messaging.",
  "frontend/src/components/admin/AccessManagementDialog.tsx": "Admin dialog for granting, revoking, and approving access entitlements with user selection and status display.",
  "frontend/src/components/auth/AuthenticatedLoadingShell.tsx": "Full‑screen loading view shown while authenticated user data is loading.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/chat/ChatLayout.tsx": "Main chat layout managing thread list, thread view, user search, and access‑management dialog.",
  "frontend/src/components/chat/ChatThreadView.tsx": "Displays a chat thread, loads messages, handles blocking, deleting, and auto‑scrolling.",
  "frontend/src/components/chat/MessageComposer.tsx": "Input form for composing and sending messages with error handling.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a single message with editing, deletion, and sender details.",
  "frontend/src/components/chat/ThreadList.tsx": "Lists user threads and triggers thread selection with basic display info.",
  "frontend/src/components/chat/UserSearchStartChat.tsx": "Searches for users and creates a new chat thread, showing results and handling loading states.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog for entering and submitting a display name during initial user setup.",
  "frontend/src/components/profile/UserBadge.tsx": "Displays the current user's avatar, display name, and shortened principal.",
  "frontend/src/hooks/useAccessControl.ts": "React-query hooks for admin access checks, retrieving and modifying access entitlements, and mapping entitlement status.",
  "frontend/src/hooks/useAccessEntitlement.ts": "Hooks to check and request access permissions, refresh access-related state, and derive UI access state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useBlocking.ts": "Hooks to check block status, list blocked users, and perform block/unblock mutations with cache updates.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for fetching, saving, and registering the current user's profile, plus retrieving the current principal.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useMessages.ts": "Defines React Query mutations for sending, editing, and deleting messages, with access checks and cache invalidation.",
  "frontend/src/hooks/useThreads.ts": "Provides hooks to fetch, create, and delete chat threads and messages using React Query with identity and access checks.",
  "frontend/src/hooks/useUsers.ts": "Implements user listing, searching, and profile retrieval by aggregating entitlements and querying user profiles from the backend.",
  "frontend/src/index.css": "Sets Tailwind base styles and CSS variables for light and dark themes, including layout and safe-area adjustments.",
  "frontend/src/main.tsx": "Initializes React, wraps the app with QueryClientProvider and InternetIdentityProvider, and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Stores the project’s current state, including scope, architectural notes, known issues, and existing features for the PriveChat app. Defines admin-authorization rules, branding changes, chat behavior requirements, and deployment details."
}