{
  "kind": "build_request",
  "title": "Add Settings view listing user principals with copy button",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Add a Settings UI entry point in the authenticated app header (within `frontend/src/components/chat/ChatLayout.tsx`) that opens a Settings view (dialog or panel) without navigating away from the chat experience.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-11"
        ],
        "quotes": [
          "I want to add the principal of every user on the settings page, with a copy button."
        ]
      },
      "acceptanceCriteria": [
        "When signed in and viewing the main chat layout, a user can open a Settings view from the header.",
        "Opening/closing the Settings view does not break the existing mobile thread-list/thread-view navigation behavior.",
        "All user-facing labels in the Settings UI are in English."
      ]
    },
    {
      "id": "REQ-39",
      "text": "In the Settings view, display the current user’s full Internet Identity principal and provide a copy-to-clipboard button that copies the full principal string and shows clear success/failure feedback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-11"
        ],
        "quotes": [
          "I want to add the principal of every user on the settings page, with a copy button."
        ]
      },
      "acceptanceCriteria": [
        "The Settings view shows the current user’s full principal (not truncated).",
        "Clicking the copy button copies the principal to the clipboard.",
        "On success, the app shows an English confirmation (e.g., toast) indicating the principal was copied.",
        "If clipboard copy fails, the app shows an English error message."
      ]
    },
    {
      "id": "REQ-40",
      "text": "In the Settings view, show a list of users with each user’s display name (when available) and full principal, and provide a copy button per user that copies that user’s principal to the clipboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-11"
        ],
        "quotes": [
          "I want to add the principal of every user on the settings page, with a copy button."
        ]
      },
      "acceptanceCriteria": [
        "If the signed-in user is an admin, populate the list using the existing admin user listing hook (`useGetAllUsers()` from `frontend/src/hooks/useUsers.ts`).",
        "If the signed-in user is not an admin, populate the list using the existing authorized-user discovery hook (`useGetChatUsers()` from `frontend/src/hooks/useUsers.ts`).",
        "Each row shows a full principal (not truncated) and a copy button.",
        "Clicking a row’s copy button copies the correct principal to the clipboard and shows English success/failure feedback.",
        "The current user is not duplicated in the non-admin list (do not list the caller as a target user)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (shadcn components must be composed, not edited).",
    "Do not modify any files in `frontend/src/hooks/useInternetIdentity.ts` / `.tsx`, `frontend/src/hooks/useActor.ts`, or `frontend/src/main.tsx` (immutable paths).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not implement or change backend APIs for user discovery or user listing as part of this request.",
    "Do not fix the existing deployment issue where the master/admin principal is not recognized (the “no permission” problem) as part of this request.",
    "Do not redesign the overall app theme/branding beyond adding the requested Settings UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}